/* automatically generated by rust-bindgen */

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[allow(unused_imports)]
    use self::super::root;
    pub mod ctre {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub mod phoenix {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            impl root::ctre::phoenix::ErrorCode {
                pub const OKAY: root::ctre::phoenix::ErrorCode = ErrorCode::OK;
            }
            impl root::ctre::phoenix::ErrorCode {
                pub const TxFailed: root::ctre::phoenix::ErrorCode = ErrorCode::CAN_TX_FULL;
            }
            impl root::ctre::phoenix::ErrorCode {
                pub const CAN_INVALID_PARAM: root::ctre::phoenix::ErrorCode =
                    ErrorCode::InvalidParamValue;
            }
            impl root::ctre::phoenix::ErrorCode {
                pub const CAN_MSG_NOT_FOUND: root::ctre::phoenix::ErrorCode = ErrorCode::RxTimeout;
            }
            impl root::ctre::phoenix::ErrorCode {
                pub const CAN_NO_MORE_TX_JOBS: root::ctre::phoenix::ErrorCode =
                    ErrorCode::TxTimeout;
            }
            impl root::ctre::phoenix::ErrorCode {
                pub const CAN_NO_SESSIONS_AVAIL: root::ctre::phoenix::ErrorCode =
                    ErrorCode::UnexpectedArbId;
            }
            impl root::ctre::phoenix::ErrorCode {

                    /// The velocity for auxiliary PID[1] to target. (in sensor-units per 100ms).
                    pub auxiliaryVel: f64,
                    /// Added to the output of PID[1], should be within [-1,+1] where 0.01 = 1%.
                    pub auxiliaryArbFeedFwd: f64,
                    /// Which slot to get PIDF gains.
                    /// PID is used for position servo.
                    /// F is used as the Kv constant for velocity feed-forward.
                    /// Typically this is hard-coded
                    /// to a particular slot, but you are free to gain schedule if need be.
                    /// gain schedule if need be.
                    /// Choose from [0,3].
                    pub profileSlotSelect0: u32,
                    /// Which slot to get PIDF gains for auxiliary PID.
                    /// This only has impact during MotionProfileArc Control mode.
                    /// Choose from [0,3].
                    pub profileSlotSelect1: u32,
                    /// Set to true to signal Talon that this is the final point, so do not
                    /// attempt to pop another trajectory point from out of the Talon buffer.
                    /// Instead continue processing this way point.  Typically the velocity
                    /// member variable should be zero so that the motor doesn't spin indefinitely.
                    pub isLastPoint: bool,
                    /// Set to true to signal Talon to zero the selected sensor.
                    /// When generating MPs, one simple method is to make the first target position zero,
                    /// and the final target position the target distance from the current position.
                    /// Then when you fire the MP, the current position gets set to zero.
                    /// If this is the intent, you can set zeroPos on the first trajectory point.
                    ///
                    /// Otherwise you can leave this false for all points, and offset the positions
                    /// of all trajectory points so they are correct.
                    ///
                    /// If using multiple sensor sources (Arc modes) we recommend you manually set sensor positions
                    /// before arming MP.
                    pub zeroPos: bool,
                    /// Duration (ms) to apply this trajectory pt.
                    /// This time unit is ADDED to the existing base time set by
                    /// ConfigMotionProfileTrajectoryPeriod().
                    pub timeDur: ::std::os::raw::c_int,
                    /// If using MotionProfileArc, this flag must be true on all points.
                    /// If using MotionProfile, this flag must be false on all points.
                    pub useAuxPID: bool,
                }
                #[test]
                fn bindgen_test_layout_TrajectoryPoint() {
                    assert_eq!(
                        ::std::mem::size_of::<TrajectoryPoint>(),
                        80usize,
                        concat!("Size of: ", stringify!(TrajectoryPoint))
                    );
                    assert_eq!(
                        ::std::mem::align_of::<TrajectoryPoint>(),
                        8usize,
                        concat!("Alignment of ", stringify!(TrajectoryPoint))
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).position as *const _
                                as usize
                        },
                        0usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(position)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).velocity as *const _
                                as usize
                        },
                        8usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(velocity)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).arbFeedFwd as *const _
                                as usize
                        },
                        16usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(arbFeedFwd)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).headingDeg as *const _
                                as usize
                        },
                        24usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(headingDeg)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).auxiliaryPos as *const _
                                as usize
                        },
                        32usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(auxiliaryPos)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).auxiliaryVel as *const _
                                as usize
                        },
                        40usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(auxiliaryVel)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).auxiliaryArbFeedFwd
                                as *const _ as usize
                        },
                        48usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(auxiliaryArbFeedFwd)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).profileSlotSelect0
                                as *const _ as usize
                        },
                        56usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(profileSlotSelect0)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).profileSlotSelect1
                                as *const _ as usize
                        },
                        60usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(profileSlotSelect1)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).isLastPoint as *const _
                                as usize
                        },
                        64usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(isLastPoint)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).zeroPos as *const _ as usize
                        },
                        65usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(zeroPos)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).timeDur as *const _ as usize
                        },
                        68usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(timeDur)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<TrajectoryPoint>())).useAuxPID as *const _
                                as usize
                        },
                        72usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(TrajectoryPoint),
                            "::",
                            stringify!(useAuxPID)
                        )
                    );
                }
                /// Motion Profile Status
                /// This is simply a data transer object.
                #[repr(C)]
                #[derive(Debug, Copy, Clone)]
                pub struct MotionProfileStatus {
                    /// The available empty slots in the trajectory buffer.
                    ///
                    /// The robot API holds a "top buffer" of trajectory points, so your applicaion
                    /// can dump several points at once.  The API will then stream them into the Talon's
                    /// low-level buffer, allowing the Talon to act on them.
                    pub topBufferRem: usize,
                    /// The number of points in the top trajectory buffer.
                    pub topBufferCnt: usize,
                    /// The number of points in the low level Talon/Victor buffer.
                    pub btmBufferCnt: ::std::os::raw::c_int,
                    /// Set if isUnderrun ever gets set.
                    /// Can be manually cleared by ClearMotionProfileHasUnderrun() or automatically cleared by StartMotionProfile().
                    /// @see clearMotionProfileHasUnderrun()
                    pub hasUnderrun: bool,
                    /// This is set if Talon/Victor needs to shift a point from its buffer into
                    /// the active trajectory point however the buffer is empty. This gets cleared
                    /// automatically when is resolved.
                    pub isUnderrun: bool,
                    /// True if the active trajectory point is not empty, false otherwise.
                    /// The members in activePoint are only valid if this signal is set.
                    pub activePointValid: bool,
                    /// True if the active trajectory point is the last point of the profile
                    pub isLast: bool,
                    /// The selected PID[0] profile slot of current profile
                    pub profileSlotSelect0: ::std::os::raw::c_int,
                    /// The selected auxiliary PID[1] profile slot of current profile
                    pub profileSlotSelect1: ::std::os::raw::c_int,
                    /// The current output mode of the motion profile executer (disabled, enabled, or hold).
                    /// When changing the set() value in MP mode, it's important to check this signal to
                    /// confirm the change takes effect before interacting with the top buffer.
                    pub outputEnable: root::ctre::phoenix::motion::SetValueMotionProfile,
                    /// The applied duration of the active trajectory point
                    pub timeDurMs: ::std::os::raw::c_int,
                }
                #[test]
                fn bindgen_test_layout_MotionProfileStatus() {
                    assert_eq!(
                        ::std::mem::size_of::<MotionProfileStatus>(),
                        40usize,
                        concat!("Size of: ", stringify!(MotionProfileStatus))
                    );
                    assert_eq!(
                        ::std::mem::align_of::<MotionProfileStatus>(),
                        8usize,
                        concat!("Alignment of ", stringify!(MotionProfileStatus))
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<MotionProfileStatus>())).topBufferRem as *const _
                                as usize
                        },
                        0usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(MotionProfileStatus),
                            "::",
                            stringify!(topBufferRem)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<MotionProfileStatus>())).topBufferCnt as *const _
                                as usize
                        },
                        8usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(MotionProfileStatus),
                            "::",
                            stringify!(topBufferCnt)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<MotionProfileStatus>())).btmBufferCnt as *const _
                                as usize
                        },
                        16usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(MotionProfileStatus),
                            "::",
                            stringify!(btmBufferCnt)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<MotionProfileStatus>())).hasUnderrun as *const _
                                as usize
                        },
                        20usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(MotionProfileStatus),
                            "::",
                            stringify!(hasUnderrun)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<MotionProfileStatus>())).isUnderrun as *const _
                                as usize
                        },
                        21usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(MotionProfileStatus),
                            "::",
                            stringify!(isUnderrun)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<MotionProfileStatus>())).activePointValid
                                as *const _ as usize
                        },
                        22usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(MotionProfileStatus),
                            "::",
                            stringify!(activePointValid)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<MotionProfileStatus>())).isLast as *const _
                                as usize
                        },
                        23usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(MotionProfileStatus),
                            "::",
                            stringify!(isLast)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<MotionProfileStatus>())).profileSlotSelect0
                                as *const _ as usize
                        },
                        24usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(MotionProfileStatus),
                            "::",
                            stringify!(profileSlotSelect0)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<MotionProfileStatus>())).profileSlotSelect1
                                as *const _ as usize
                        },
                        28usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(MotionProfileStatus),
                            "::",
                            stringify!(profileSlotSelect1)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<MotionProfileStatus>())).outputEnable as *const _
                                as usize
                        },
                        32usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(MotionProfileStatus),
                            "::",
                            stringify!(outputEnable)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            &(*(::std::ptr::null::<MotionProfileStatus>())).timeDurMs as *const _
                                as usize
                        },
                        36usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(MotionProfileStatus),
                            "::",
                            stringify!(timeDurMs)
                        )
                    );
                }
                impl Default for MotionProfileStatus {
                    fn default() -> Self {
                        unsafe { ::std::mem::zeroed() }
                    }
                }
            }
            #[repr(u32)]
            /// Enumerated type for status frame types.
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum CANifierControlFrame {
                CANifier_Control_1_General = 50593792,
                CANifier_Control_2_PwmOutput = 50593856,
            }
            #[repr(u32)]
            /// Enumerated type for status frame types.
            #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
            pub enum CANifierStatusFrame {
                Status_1_General = 267264,
